Tekla Open API Reference for Tekla Structures 2025
BaseComponent.Number Property
 The number of the component. A number greater than zero identifies system components, for custom components the number is CUSTOM_OBJECT_NUMBER, and for plug-ins the number is PLUGIN_OBJECT_NUMBER.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Number { get; set; }
Public Property Number As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
BaseComponent Class
Tekla.Structures.Model Namespace